// Масиви

// Масивите са специален тип променлива, която може да съдържа нула, едно или повече стойности – итерируема колекция от стойности.
let emptyArray = [];
let oneValueArray = [1];
let primes = [2, 3, 5, 7, 11];

// Масивите могат да се разглеждат като последователности от елементи. Елементите имат определен ред. Всеки елемент може да бъде достъпен чрез индекса си. Индексите започват от нула
let thirdPrime = primes[2];

// *********************
// Елементи на масив

// Масивите могат да съдържат колекция от елементи от един и същ тип, но поради динамичната природа на JavaScript, те могат да съдържат и различни типове данни
// Елементите на масив се достъпват чрез индекс

let weekend = ['Saturday', 'Sunday'];
let saturday = weekend[0]; // прочитаме първия елемент
let sunday = weekend[1];   // прочитаме втория елемент

// Елементите на масива могат да се променят чрез индекса им
let evens = [2, 4, 5, 8];
evens[2] = 6; // променяме третия елемент на 6 → [2, 4, 6, 8]

// ************************
// Дължина на масив

// Масивите имат свойство length, което връща броя на елементите в масива
let empty = [];
console.log(empty.length); // 0

let fibonacci = [1, 1, 2, 3, 5, 8];
console.log(fibonacci.length); // 6

// Ако не знаем колко елемента има масивът, можем да достъпим последния елемент чрез дължината му
let numbers = [1, 2, 3, 4, 5, 6];
let lastNumber = numbers[numbers.length - 1]; // 6

// Използвай свойството length само за четене на размера на масива!
// Не го променяй ръчно – това ще изтрие елементи или ще добави празни стойности

// **************************
// Методите на масивите

// Масивите имат много полезни методи за работа с тях
// Добавяне на елемент в края на масива
let names = ['John', 'Peter'];
names.push('Jane');
// [ 'John', 'Peter', 'Jane' ]

// Премахване и получаване на последния елемент от масива
let lastName = names.pop();
console.log(lastName); // 'Jane'

// Добавяне на елемент в началото на масива
names.unshift(lastName);
// [ 'Jane', 'John', 'Peter' ]


// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array
// https://developer.mozilla.org/en-US/docs/Learn_web_development/Core/Scripting/Arrays